In [1]:
import pandas as pd
import pylab as plt
import seaborn as sns

In [2]:
fest  = pd.read_csv('../data_clean/scrapeo/festivos_provincia.csv')
norm = pd.read_csv('../data_clean/scrapeo/normativas.csv')
denu = pd.read_csv('../data_clean/portal_estadistico_vio_gen/denuncias.csv')
llam = pd.read_csv('../data_clean/portal_estadistico_vio_gen/llamadas016.csv')
ord = pd.read_csv('../data_clean/portal_estadistico_vio_gen/ordenes_prot.csv')
disp = pd.read_csv('../data_clean/portal_estadistico_vio_gen/dispositivos.csv')
men = pd.read_csv('../data_clean/portal_estadistico_vio_gen/menores.csv')
vic = pd.read_csv('../data_clean/portal_estadistico_vio_gen/victimas_mortales.csv')
sent = pd.read_csv('../data_clean/ine/sentencias.csv')
tipos = pd.read_csv('../data_clean/ine/tipos_violencias.csv')
cond = pd.read_csv('../data_clean/ine/condenados_edad.csv')
salud = pd.read_csv('../data_clean/ine/salud_mental.csv')
paro = pd.read_csv('../data_clean/ine/tasa_actividad.csv')
alcohol = pd.read_csv('../data_clean/ine/alcohol.csv')
educ = pd.read_csv('../data_clean/ine/nivel_educativo.csv')

In [3]:
fest.corr(numeric_only=True)

,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre
enero,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
febrero,NaN,1.000000,-0.129219,-0.366378,0.284151,-0.311659,-0.257832,-0.062718,-0.190693,-0.062718,NaN,0.244677
marzo,NaN,-0.129219,1.000000,0.352693,-0.454756,0.143385,-0.162882,-0.039621,-0.120468,-0.039621,NaN,-0.357448
abril,NaN,-0.366378,0.352693,1.000000,-0.261754,-0.313215,-0.103191,-0.112340,-0.018298,-0.112340,NaN,-0.114783
mayo,NaN,0.284151,-0.454756,-0.261754,1.000000,-0.365185,-0.225926,-0.220721,-0.320095,0.087127,NaN,0.360673
junio,NaN,-0.311659,0.143385,-0.313215,-0.365185,1.000000,-0.044672,-0.095562,-0.290552,-0.095562,NaN,-0.199911
julio,NaN,-0.257832,-0.162882,-0.103191,-0.225926,-0.044672,1.000000,0.243252,0.372111,-0.079057,NaN,-0.634630
agosto,NaN,-0.062718,-0.039621,-0.112340,-0.220721,-0.095562,0.243252,1.000000,0.328897,-0.019231,NaN,-0.256330
septiembre,NaN,-0.190693,-0.120468,-0.018298,-0.320095,-0.290552,0.372111,0.328897,1.000000,-0.058471,NaN,-0.275629
octubre,NaN,-0.062718,-0.039621,-0.112340,0.087127,-0.095562,-0.079057,-0.019231,-0.058471,1.000000,NaN,0.075023
noviembre,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
diciembre,NaN,0.244677,-0.357448,-0.114783,0.360673,-0.199911,-0.634630,-0.256330,-0.275629,0.075023,NaN,1.000000

In [4]:
fest.describe()

,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre
count,53.0,53.000000,53.000000,53.000000,53.000000,53.000000,53.000000,53.000000,53.000000,53.000000,53.0,53.000000
mean,2.0,0.169811,0.075472,2.396226,0.716981,0.433962,0.245283,1.018868,0.150943,1.018868,1.0,2.773585
std,0.0,0.379060,0.266679,0.493793,0.454776,0.635774,0.434372,0.137361,0.361420,0.137361,0.0,0.422516
min,2.0,0.000000,0.000000,2.000000,0.000000,0.000000,0.000000,1.000000,0.000000,1.000000,1.0,2.000000
25%,2.0,0.000000,0.000000,2.000000,0.000000,0.000000,0.000000,1.000000,0.000000,1.000000,1.0,3.000000
50%,2.0,0.000000,0.000000,2.000000,1.000000,0.000000,0.000000,1.000000,0.000000,1.000000,1.0,3.000000
75%,2.0,0.000000,0.000000,3.000000,1.000000,1.000000,0.000000,1.000000,0.000000,1.000000,1.0,3.000000
max,2.0,1.000000,1.000000,3.000000,1.000000,2.000000,1.000000,2.000000,1.000000,2.000000,1.0,3.000000

In [5]:
llam.head()

    año trimestre     llamante provincia  comunidad  total_llamadas
0  2007   tercero      usuaria   almeria  andalucia               3
1  2007   tercero     familiar   almeria  andalucia               0
2  2007   tercero  desconocido   almeria  andalucia               0
3  2007    cuarto      usuaria   almeria  andalucia             150
4  2007    cuarto     familiar   almeria  andalucia              27

In [6]:
llam_dum = pd.get_dummies(llam, columns=['año', 'trimestre', 'llamante', 'provincia'])
llam_dum.head()

,comunidad,total_llamadas,año_2007,año_2008,año_2009,año_2010,año_2011,año_2012,año_2013,año_2014,...,provincia_sevilla,provincia_soria,provincia_tarragona,provincia_teruel,provincia_toledo,provincia_valencia,provincia_valladolid,provincia_vizcaya,provincia_zamora,provincia_zaragoza
0,andalucia,3,True,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,andalucia,0,True,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,andalucia,0,True,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,andalucia,150,True,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,andalucia,27,True,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [7]:
denu.describe(include='object').T

                 count unique              top  freq
trimestre        21112      4          primero  5460
origen_denuncia  21112      7          victima  3016
provincia        21112     51           cuenca   812
comunidad        21112     18  castilla y leon  3654

In [8]:
denu.head()

,año,trimestre,origen_denuncia,provincia,comunidad,total_denuncias
0,2009,primero,victima,almeria,andalucia,40
1,2009,primero,familiar,almeria,andalucia,1
2,2009,primero,policia_victima,almeria,andalucia,419
3,2009,primero,policia_familiar,almeria,andalucia,7
4,2009,primero,intervencion_policial_directa,almeria,andalucia,82

In [9]:
llam.head()

    año trimestre     llamante provincia  comunidad  total_llamadas
0  2007   tercero      usuaria   almeria  andalucia               3
1  2007   tercero     familiar   almeria  andalucia               0
2  2007   tercero  desconocido   almeria  andalucia               0
3  2007    cuarto      usuaria   almeria  andalucia             150
4  2007    cuarto     familiar   almeria  andalucia              27

In [12]:
llam.groupby('llamante')['total_llamadas'].sum()

llamante
0               16864
desconocido     34741
familiar       297942
usuaria        869482
Name: total_llamadas, dtype: int64

In [ ]:
llam.describe(include='object').T

           count unique              top  freq
trimestre  12508      4          tercero  3233
llamante   12508      4      desconocido  4452
provincia  12508     51           cuenca   472
comunidad  12508     18  castilla y leon  2124

In [13]:
llam.groupby('llamante')['total_llamadas'].count()

llamante
0              1166
desconocido    4452
familiar       3445
usuaria        3445
Name: total_llamadas, dtype: int64

In [ ]:
ord.describe(include='object').T

          count unique              top freq
trimestre  3016      4          primero  780
provincia  3016     51           cuenca  116
comunidad  3016     18  castilla y leon  522

In [ ]:
men.describe(include='object').T

                count unique        top freq
trimestre         912      4    segundo  323
edad              912      9        5-6  133
padre_biologico   912      2         si  817
suicidio          912      3         si  494
provincia         912     19    almeria   48
comunidad         912     13  andalucia  192

In [ ]:
men.head()

,año,trimestre,edad,padre_biologico,suicidio,provincia,comunidad,total_menores_vict_mortales
0,2013,primero,3-4,si,no,almeria,andalucia,0
1,2013,segundo,<1,si,si,almeria,andalucia,0
2,2013,segundo,5-6,si,si,almeria,andalucia,0
3,2013,segundo,11-12,si,si,almeria,andalucia,0
4,2013,tercero,5-6,si,no,almeria,andalucia,0

In [ ]:
men.groupby('edad')['total_menores_vict_mortales'].sum()

edad
1-2      8
11-12    7
13-14    1
15-17    2
3-4      5
5-6      8
7-8      7
9-10     7
<1       5
Name: total_menores_vict_mortales, dtype: int64

In [ ]:
corr = df.corr()
sns.set(style='white')       # estilo blanco

mascara = np.triu(np.ones_like(corr, dtype=bool))   # mascara

cmap = sns.diverging_palette(0, 10, as_cmap=True)   # paleta de colores



sns.heatmap(corr,             # datos
            mask=mascara,     # mascara
            cmap=cmap,        # mapa de color
            
            vmax=1,           # maximo vertical
            vmin=-1,          # minimo vertical
            center=0,         # centro
            
            square=True,      # cuadrado el dato pintado
            linewidth=0.5,    # ancho de la linea
            
            cbar_kws={'shrink': 0.5},  # barra de color
            annot=True                 # anotacion, el numero escrito
            
           );